<template>
    <div>
      <v-container>
        <v-row class="protocol-title-box">
          <v-spacer></v-spacer>
          <v-col>
            <v-card class="mx-auto my-12 rounded-lg" flat min-width="80%">
              <div class="text-center protocol-title">
                EasyBlog &nbsp;<span class="font-weight-bold">•&nbsp;隐私政策</span>
              </div>
            </v-card>
          </v-col>
          <v-spacer></v-spacer>
        </v-row>
        <v-row>
          <v-divider></v-divider>
        </v-row>
        <v-row>
          <div class="protocol-container article-content">
            <p>欢迎您来到EasyBlog。</p>

            <p>
              作为EasyBlog的运营者，我们深知个人信息对您的重要性，同时我们也非常重视您的隐私保护和个人信息保护。您在使用EasyBlog提供的服务时，我们也可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的EasyBlog服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。
            </p>

            <div class="content-box">
              <p style="margin-bottom: 5px">
                本隐私政策将帮助您了解以下内容：
              </p>
              <ul class="privacy_content">
                <li>
                  一、我们如何收集和使用个人信息
                </li>
                <li>
                  二、我们如何使用 Cookie 和同类技术
                </li>
                <li>
                  三、我们如何共享、转让、公开披露您的个人信息
                </li>
                <li>
                  四、我们如何保存及保护您的个人信息
                </li>
                <li>
                  五、管理您的个人信息
                </li>
                <li>
                  六、未成年人保护
                </li>
                <li>
                  七、隐私政策的修订和通知
                </li>
                <li>
                  八、联系我们
                </li>
              </ul>
            </div>

            <div class="content-box">
              <h2 class="rule">一、我们如何收集和使用个人信息</h2>
              <p>
                在您使用EasyBlog提供的以下服务或功能过程中，我们将基于以下基本功能收集您的相关必要个人信息。
              </p>
              <div class="inner-content-box">
                <h4 class="inner-rule">1.1 帐号注册和使用</h4>
                <p>
                  在您注册EasyBlog时，我们将记录您设置的昵称、密码、电子邮箱及手机号码，收集这些信息是为了帮助您完成账号的注册。您可以根据自身需求选择是否设置头像，以及完善其他个人信息。如果不注册账号，并不会影响您浏览EasyBlog的内容，但会影响您发布博文、评论，及其他一些功能的使用。
                </p>
                <p>
                  若您以其他方式关联登录EasyBlog，我们会向关联第三方请求您的个人信息。当您使用微信登录时，我们会获取您的微信头像、昵称，以及您设置的昵称；当您使用QQ登录时，我们会访问获取您的QQ头像、昵称、性别，以及您设置的昵称、电子邮箱、手机号码；当您使用
                  GitHub/Gitee 登录时，我们会获取您的 GitHub/Gitee
                  头像、昵称，以及您设置的电子邮箱、手机号码。在您使用第三方帐号注册或登录后，您的第三方帐号将会与EasyBlog账号进行绑定，您可以在【账户中心】的“关联第三方账户”中解除绑定。 </p>
                <p>
                  为了确保账号安全和落实网络实名制，在您使用其他方式关联登录、使用EasyBlog的某些功能时，您可能仍然需要绑定有效的手机号码。收集这些信息是为了帮您创建EasyBlog账号和对您进行实名验证，如果您拒绝提供这些信息，将影响您注册EasyBlog账号。 </p>
              </div>
              <div class="inner-content-box">
                <h4 class="inner-rule">1.2 内容发布与互动</h4>
                <p>
                  在您注册、登录EasyBlog并成功申请了博客后，您可以在EasyBlog平台上发布博文（包括随笔、文章、日记）、评论。在此过程中，我们会收集您发布的信息（包括文字、图片或视频），并展示您的显示昵称、头像、发布内容。
                </p>
                <p>
                  您可以通过EasyBlog平台与其他用户进行互动，包括收藏、推荐或反对用户的博文，订阅博客，关注其他用户。我们会收集您关注的帐号、订阅的博客列表，并向您展示您关注帐号发布的内容及订阅的博客内容。
                </p>
              </div>
              <div class="inner-content-box">
                <h4 class="inner-rule">1.3 搜索功能</h4>
                <p>
                  当您使用EasyBlog提供的搜索功能时，我们会收集和使用您的搜索关键字信息并进行本地存储，我们不会向EasyBlog服务器上传您的历史关键词。搜索结果将根据您的搜索关键词进行展示。
                </p>
              </div>
            </div>

            <div class="content-box">
              <h2 class="rule">二、我们如何使用 Cookie 和同类技术</h2>
              <p>
                Cookie 和相关技术可以帮助网站辨别注册用户，计算用户数量，通常被各网站用来判定完成注册的用户是否已经实现登录，我们使用 Cookie 及相关技术主要为了实现以下功能或服务：
              </p>
              <ol>
                <li>
                  <p>保障产品或服务的安全、高效运转。我们可能会设置认证与保障安全性的
                    Cookie，以便确认您是否安全登录服务，或者是否遇到盗用、欺诈及其他不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。</p>
                </li>
                <li>
                  <p>简化您的操作步骤。使用此类技术，可以帮助您省去重复填写个人信息、输入搜索内容的步骤和流程，帮您获得更轻松的访问体验。</p>
                </li>
              </ol>
              <p>如您不希望个人信息保存在 Cookie 中，您可对浏览器进行配置，选择禁用 Cookie 功能。</p>
            </div>

            <div class="content-box">
              <h2 class="rule">三、我们如何共享、转让、公开披露您的个人信息</h2>
              <p>
                EasyBlog不会向第三方共享、转让您的个人信息，除非经过您本人事先授权同意，或者共享、转让的个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主体。
              </p>
              <div class="inner-content-box">
                <h4 class="inner-rule">3.1 共享</h4>
                <p>
                  除以下情形外，我们不会与任何公司、组织和个人共享您的个人信息：
                </p>
                <ol>
                  <li>
                    <p>事先获得您的明确授权或同意后共享。获得您的明确同意后，我们会与其他方共享您的个人信息。</p>
                  </li>
                  <li>
                    <p>在法定情形下的共享。根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息。</p>
                  </li>
                  <li>
                    <p>为保护合法利益的共享。在法律要求或允许的范围内，为了保护EasyBlog及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方。</p>
                  </li>
                  <li>
                    <p>您的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息，且受本政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。</p>
                  </li>
                </ol>
              </div>
              <div class="inner-content-box">
                <h4 class="inner-rule">3.2 转让</h4>
                <p>
                  我们不会转让您的个人信息给任何其他第三方，除非征得您的明确同意。
                  如果发生合并、收购或破产清算，您的个人信息有可能作为此类交易的一部分而被转移，我们将确保该等信息在转移时的机密性，并要求新的持有您个人信息的公司、组织继续受此个人信息保护政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
                </p>
              </div>
              <div class="inner-content-box">
                <h4 class="inner-rule">3.3 公开披露</h4>
                <p>
                  除非获取您的明确同意，我们不会公开披露您的个人信息。
                  但基于法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们会向有权机关披露您的个人信息。但我们保证，在上述情况发生时，我们会要求披露请求方必须出具与之相应的有效法律文件，同时尽合理可能对被披露的信息采取符合法律和业界标准的安全防护措施。
                </p>
              </div>
            </div>

            <div class="content-box">
              <h2 class="rule">四、我们如何保存及保护您的个人信息</h2>
              <div class="inner-content-box">
                <h4 class="inner-rule">4.1 个人信息的存储</h4>
                <p>
                  我们依照法律法规的规定，将境内收集的您的个人信息存储于中华人民共和国境内。目前，我们不会跨境传输或存储您的个人信息，将来如果发生数据的跨境传输，我们会向您告知出境个人信息的类型、目的、接收方等，并征得您的授权同意。我们仅在本隐私政策所述目的所必需的期间内保留您的个人信息。超出必要期限后，我们会将您的个人信息删除或做匿名化处理。
                </p>
              </div>
              <div class="inner-content-box">
                <h4 class="inner-rule">4.2 个人信息的保护措施</h4>
                <p>
                  我们已采取符合业界标准、合理可行的安全防护措施保护您的信息，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。例如，我们的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户个人信息在传输过程中的安全；通过采取加密技术对用户个人信息进行加密保存；设立严格的数据使用和访问制度，确保只有授权人员才可访问您的个人信息。
                </p>
                <p>
                  尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。
                </p>
                <p>
                  您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保证个人信息的安全，例如定期修改账号密码，不将自己的账号密码等个人信息透露给他人。
                </p>
                <p>
                  若不幸发生个人信息安全事件，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。我们会以站内短消息、邮件、短信等形式告知您，并在EasyBlog公共运营平台进行告知。
                </p>
                <p>
                  我们提供的个人信息保护措施仅适用于EasyBlog。您一旦离开EasyBlog，浏览或使用其他网站、服务及内容资源，我们将没有能力及义务保护您在EasyBlog以外的网站提交的任何个人信息，无论您登录或浏览上述网站是否基于EasyBlog的链接或引导。
                </p>
              </div>
            </div>

            <div class="content-box">
              <h2 class="rule">五、管理您的个人信息</h2>
              <p>
                我们非常重视您对个人信息的管理，并尽全力保障您对于个人信息的访问、更正、删除以及注销帐号的相关权利，使您拥有充分的能力维护您的隐私和个人信息安全。
              </p>
              <div class="inner-content-box">
                <h4 class="inner-rule">5.1 访问和修改您的个人信息</h4>
                <p>
                  您在完成EasyBlog账号的注册后，可以通过EasyBlog【个人中心】查看、修改您提交给我们的个人信息，包括：头像、用户名、邮箱、手机号码、关联的第三方账户等。您也可以通过【个人中心】完善或修改“个人资料”页面的信息，包括：您的姓名、性别、出生日期、技术兴趣、自我介绍等，同时您可以对这部分信息设置仅部分用户可见或隐藏。
                </p>
              </div>
              <div class="inner-content-box">
                <h4 class="inner-rule">5.2 个人信息的存储</h4>
                <p>
                  在以下情形，您可以通过本隐私政策公布的联系方式与我们联系，向我们提出删除您的个人信息的请求：
                </p>
                <ol>
                  <li>
                    <p>如果我们处理个人信息的行为违反法律法规；</p>
                  </li>
                  <li>
                    <p>如果我们处理个人信息的行为违反了与您的约定；</p>
                  </li>
                  <li>
                    <p>如果我们不再为您提供产品或服务。</p>
                  </li>
                </ol>
              </div>
              <div class="inner-content-box">
                <h4 class="inner-rule">5.3 注销账号</h4>
                <p>
                  您可以在EasyBlog网站【账户中心】的“账户设置”下方对账号进行注销操作，也可以通过本隐私政策公布的联系方式申请注销您的EasyBlog账号。请您理解，注销帐号的行为是不可逆的行为，建议您做好相关内容的备份。
                </p>
              </div>
            </div>

            <div class="content-box">
              <h2 class="rule"> 六、未成年人保护</h2>
              <p>
                若您是未满18周岁的未成年人，在使用EasyBlog前，应在您的父母（或其他监护人）监护、指导下共同阅读并决定是否同意本政策。我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、储存、共享、转让或披露未成年人的个人信息。如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。
              </p>
            </div>

            <div class="content-box">
              <h2 class="rule"> 七、隐私政策的修订和通知</h2>
              <p>
                为给您提供更好的服务以及随着我们业务的发展，本隐私政策也会随之更新。未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。对于重大变更，我们还会提供更为显著的通知。本隐私政策所指的重大变更包括但不限于：
              </p>
              <ol>
                <li>
                  <p>我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</p>
                </li>
                <li>
                  <p>我们在所有权结构、组织架构等方面发生重大变化，导致实际收集和处理您的个人信息的主体发生变化，如业务调整、破产并购等引起的所有者变更等；</p>
                </li>
                <li>
                  <p>个人信息共享、转让或公开披露的主要对象发生变化；</p>
                </li>
                <li>
                  <p>您参与个人信息处理方面的权利及其行使方式发生重大变化；</p>
                </li>
                <li>
                  <p>我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</p>
                </li>
                <li>
                  <p>个人信息安全影响评估报告表明存在高风险时。</p>
                </li>
              </ol>
            </div>

            <div class="content-box">
              <h2 class="rule">八、联系我们</h2>
              <p>联系邮箱：easyblog_kefu@163.com（相关事务请发函至该邮箱）</p>
            </div>
          </div>
        </v-row>
        <v-row class="update_day">
          <p>更新日期：2022年03月17日</p>
        </v-row>
        <v-row style="clear: both">
          <v-divider></v-divider>
        </v-row>
        <v-row class="footer">
          <app-simple-footer></app-simple-footer>
        </v-row>
      </v-container>
    </div>
</template>

<script>


import AppSimpleFooter from '@/components/AppSimpleFooter'

export default {
  name: 'UserPrivacyView',
  components: {AppSimpleFooter}
}
</script>

<style scoped>
.protocol-container {
  margin-top: 25px;
}

.protocol-title-box {
  height: 140px;
}

.privacy_content li {
  font-weight: 600;
}

.article-content ol {
  list-style: decimal outside none;
}

.article-content li {
  line-height: 26px;
  list-style-type: inherit !important;
  margin: 0 0 0.35rem;
}

.rule {
  margin: 16px auto 15px auto;
  font-size: 20px;
  color: #333;
}

.inner-rule {
  margin-bottom: 10px;
  color: #333;
}

.update_day {
  float: right;
  margin: 20px auto 1px auto;
}

ul {
  list-style: none;
  padding-left: 5px;
}
</style>
